app/Controllers/Home.php

    public function listarAutomoveis() : string
    {
        $automoveis_model = new AutomoveisModel;

        $data['dados'] = $automoveis_model->findAll();
---
SELECT *
FROM `automoveis`

    public function salvarAutomoveis()
    {
        $data = array(
            'marca' => $this->request->getVar('marca_input'),
            'modelo' => $this->request->getVar('modelo_input'),
            'km' => $this->request->getVar('km_input'),
            'ano' => $this->request->getVar('ano_input'),
            'preco' => $this->request->getVar('preco_input')
        );

        $automoveis_model = new AutomoveisModel;
        $automoveis_model->insert($data);
---
INSERT INTO `automoveis` (`marca`, `modelo`, `km`, `ano`, `preco`) VALUES ('Volvo', 'Volvo', '45000', '2023', '3400000')